z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
#include "transport_core.h"

#include <limits.h>
#include <string.h>

#include "nrf24_regs.h"

#define TRANSPORT_WIRE_UNASSIGNED_ID (0xffu)
#define TRANSPORT_IRQ_MAX_RX_PAYLOADS (3u)
#define TRANSPORT_CONTROL_RECORD_SIZE (TRANSPORT_CORE_CONTROL_RECORD_SIZE)

static void core_control_acked(transport_core_t *, const uint8_t *);
static void core_control_failed(transport_core_t *, const uint8_t *);
static void core_finish_outbound_command(transport_core_t *, uint8_t, bool,
    uint32_t);
static void core_finish_outbound_pipe(transport_core_t *, uint8_t, bool,
    uint32_t);
static void core_finish_registration_tx(transport_core_t *, bool, uint32_t);

static uint32_t core_now_ms(transport_core_t *core) {
    if (core->config.radio.ticks_ms == NULL) return 0;
    return core->config.radio.ticks_ms(core->config.radio.context);
}

static bool core_deadline_reached(uint32_t now, uint32_t deadline) {
    return (int32_t)(now - deadline) >= 0;
}

static bool core_radio_io_ok(transport_core_t *core) {
    return core->config.radio.io_ok == NULL ||
        core->config.radio.io_ok(core->config.radio.context);
}

static bool core_radio_irq_is_low(transport_core_t *core) {
    return core->config.radio.irq_is_low != NULL &&
        core->config.radio.irq_is_low(core->config.radio.context);
}

static uint32_t core_crc32_update(uint32_t crc, const uint8_t *data,
        size_t length) {
    size_t i;
    crc ^= 0xffffffffu;
    for (i = 0; i < length; ++i) {
        uint8_t bit;
        crc ^= data[i];
        for (bit = 0; bit < 8; ++bit) {
            uint32_t mask = 0u - (crc & 1u);
            crc = (crc >> 1) ^ (0xedb88320u & mask);
        }
    }
    return crc ^ 0xffffffffu;
}

static uint16_t core_read_le16(const uint8_t *data) {
    return (uint16_t)data[0] | (uint16_t)((uint16_t)data[1] << 8);
}

static uint32_t core_read_le32(const uint8_t *data) {
    return (uint32_t)data[0] | ((uint32_t)data[1] << 8) |
        ((uint32_t)data[2] << 16) | ((uint32_t)data[3] << 24);
}

static void core_write_le16(uint8_t *data, uint16_t value) {
    data[0] = (uint8_t)value;
    data[1] = (uint8_t)(value >> 8);
}

static void core_write_le32(uint8_t *data, uint32_t value) {
    data[0] = (uint8_t)value;
    data[1] = (uint8_t)(value >> 8);
    data[2] = (uint8_t)(value >> 16);
    data[3] = (uint8_t)(value >> 24);
}

static transport_critical_state_t core_enter(transport_core_t *core) {
    if (core->config.radio.critical_enter == NULL) return 0;
    return core->config.radio.critical_enter(core->config.radio.context);
}

static void core_exit(transport_core_t *core, transport_critical_state_t state) {
    if (core->config.radio.critical_exit != NULL)
        core->config.radio.critical_exit(core->config.radio.context, state);
}

static bool core_build_packet(transport_core_t *core, uint8_t message_type,
        uint8_t destination_id, uint8_t message_id, uint8_t wire_flags,
        const uint8_t *payload, size_t payload_length, uint8_t *packet) {
    uint32_t crc;
    if (core == NULL || packet == NULL || message_type > TRANSPORT_WIRE_TYPE_MASK ||
            payload_length > TRANSPORT_WIRE_MAX_DATA ||
            (payload == NULL && payload_length != 0) ||
            (wire_flags & 0x5fu) != 0) {
        return false;
    }
    memset(packet, 0, NRF24_MAX_PAYLOAD);
    packet[0] = TRANSPORT_WIRE_PROTOCOL_ID | message_type;
    packet[1] = core->config.node_id;
    packet[2] = destination_id;
    packet[3] = message_id;
    packet[4] = wire_flags | (uint8_t)payload_length;
    if (payload_length != 0) {
        memcpy(packet + TRANSPORT_WIRE_HEADER_SIZE, payload, payload_length);
    }
    crc = core_crc32_update(0, core->config.network_id,
        sizeof(core->config.network_id));
    crc = core_crc32_update(crc, packet, TRANSPORT_WIRE_HEADER_SIZE);
    crc = core_crc32_update(crc, packet + TRANSPORT_WIRE_HEADER_SIZE,
        payload_length);
    packet[TRANSPORT_WIRE_HEADER_SIZE + payload_length] = (uint8_t)crc;
    return true;
}

static void core_restore_rx(transport_core_t *core) {
    transport_critical_state_t critical = core_enter(core);
    nrf24_enter_rx_mode(core->config.radio.radio);
    core_exit(core, critical);
}

static void core_tx_kick(transport_core_t *core) {
    uint8_t packet[NRF24_MAX_PAYLOAD];
    uint8_t fragment[TRANSPORT_WIRE_MAX_DATA];
    uint8_t address[NRF24_ADDR_LEN];
    uint8_t slot;
    size_t payload_length = 0;
    bool last_packet = false;
    bool application_tx_ready;
    transport_tx_kind_t kind = TRANSPORT_TX_NONE;
    transport_critical_state_t critical;
    nrf24_t *radio;
    if (core == NULL) return;
    critical = core_enter(core);
    if (!core->started || core->tx.active) {
        core_exit(core, critical);
        return;
    }
    if (transport_ring_readable(&core->control_tx) >=
            TRANSPORT_CONTROL_RECORD_SIZE &&
            transport_ring_peek(&core->control_tx, packet,
                sizeof(packet)) == sizeof(packet)) {
        kind = TRANSPORT_TX_CONTROL;
        slot = TRANSPORT_CORE_INVALID_ID;
        payload_length = 0;
        last_packet = true;
    }
    if (kind == TRANSPORT_TX_NONE && core->registration_tx.pending) {
        memcpy(packet, core->registration_tx.packet, sizeof(packet));
        memcpy(address, core->registration_tx.address, sizeof(address));
        kind = TRANSPORT_TX_REGISTRATION;
        slot = TRANSPORT_CORE_INVALID_ID;
        payload_length = packet[4] & TRANSPORT_WIRE_LENGTH_MASK;
        last_packet = true;
    }
    application_tx_ready = core_deadline_reached(core_now_ms(core),
        core->application_tx_not_before_ms);
    for (slot = 0; kind == TRANSPORT_TX_NONE && application_tx_ready &&
            slot < TRANSPORT_CORE_COMMAND_SLOTS; ++slot) {
        transport_command_slot_t *command = &core->commands[slot];
        if (command->direction == TRANSPORT_DIRECTION_TX &&
                command->state == TRANSPORT_COMMAND_TX_SENDING) {
            size_t remaining = transport_ring_readable(&command->buffer);
            payload_length = remaining;
            if (payload_length > TRANSPORT_WIRE_MAX_DATA) {
                payload_length = TRANSPORT_WIRE_MAX_DATA;
            }
            if (payload_length != 0 &&
                    transport_ring_peek(&command->buffer,
                        fragment,
                        payload_length) != payload_length) {
                core_finish_outbound_command(core, slot, false,
                    TRANSPORT_COMMAND_FAILURE_RADIO);
                core_exit(core, critical);
                return;
            }
            last_packet = remaining <= TRANSPORT_WIRE_MAX_DATA;
            if (!core_build_packet(core, command->message_type,
                    command->peer_id, (uint8_t)command->transaction_id,
                    last_packet ? TRANSPORT_WIRE_LAST_PACKET : 0,
                    fragment, payload_length,
                    packet)) {
                core_finish_outbound_command(core, slot, false,
                    TRANSPORT_COMMAND_FAILURE_RADIO);
                core_exit(core, critical);
                return;
            }
            kind = TRANSPORT_TX_COMMAND;
            break;
        }
    }
    if (kind == TRANSPORT_TX_NONE && application_tx_ready) {
        for (slot = 0; slot < TRANSPORT_CORE_PIPE_SLOTS; ++slot) {
            transport_pipe_slot_t *pipe = &core->pipes[slot];
            if (pipe->direction == TRANSPORT_DIRECTION_TX &&
                    (pipe->state == TRANSPORT_PIPE_TX_OPEN ||
                     pipe->state == TRANSPORT_PIPE_TX_CLOSING)) {
                size_t remaining = transport_ring_readable(&pipe->buffer);
                uint32_t credit = pipe->granted_bytes -
                    pipe->transferred_bytes;
                if (credit > pipe->buffer.capacity) {
                    credit = (uint32_t)pipe->buffer.capacity;
                }
                if (remaining != 0 && credit != 0) {
                    payload_length = remaining;
                    if (payload_length > TRANSPORT_WIRE_MAX_DATA) {
                        payload_length = TRANSPORT_WIRE_MAX_DATA;
                    }
                    if (payload_length > credit) payload_length = credit;
                    if (transport_ring_peek(&pipe->buffer, fragment,
                            payload_length) != payload_length ||
                            !core_build_packet(core, TRANSPORT_WIRE_STREAM,
                                pipe->peer_id, (uint8_t)pipe->session_id, 0,
                                fragment, payload_length, packet)) {
                        core_finish_outbound_pipe(core, slot, false,
                            TRANSPORT_PIPE_FAILURE_RADIO);
                        core_exit(core, critical);
                        return;
                    }
                    kind = TRANSPORT_TX_PIPE;
                    last_packet = false;
                    break;
                }
                if (pipe->state == TRANSPORT_PIPE_TX_CLOSING &&
                        remaining == 0) {
                    if (!core_build_packet(core, TRANSPORT_WIRE_STREAM,
                            pipe->peer_id, (uint8_t)pipe->session_id,
                            TRANSPORT_WIRE_LAST_PACKET, NULL, 0, packet)) {
                        core_finish_outbound_pipe(core, slot, false,
                            TRANSPORT_PIPE_FAILURE_RADIO);
                        core_exit(core, critical);
                        return;
                    }
                    kind = TRANSPORT_TX_PIPE;
                    payload_length = 0;
                    last_packet = true;
                    break;
                }
            }
        }
    }
    if (kind == TRANSPORT_TX_NONE) {
        for (slot = 0; slot < TRANSPORT_CORE_COMMAND_SLOTS; ++slot) {
            if (core->commands[slot].direction == TRANSPORT_DIRECTION_TX &&
                    core->commands[slot].state ==
                        TRANSPORT_COMMAND_TX_WAIT_CTS) {
                core_exit(core, critical);
                return;
            }
        }
        for (slot = 0; slot < TRANSPORT_CORE_PIPE_SLOTS; ++slot) {
            if (core->pipes[slot].direction == TRANSPORT_DIRECTION_TX &&
                    core->pipes[slot].state ==
                        TRANSPORT_PIPE_TX_WAIT_CTS) {
                core_exit(core, critical);
                return;
            }
        }
        core_exit(core, critical);
        return;
    }
    core->tx.destination_id = packet[2];
    if (kind != TRANSPORT_TX_REGISTRATION) {
        address[0] = core->tx.destination_id;
        memcpy(address + 1, core->config.network_id,
            sizeof(core->config.network_id));
    }
    radio = core->config.radio.radio;
    nrf24_enter_tx_mode(radio);
    nrf24_open_tx_pipe(radio, address);
    if (!core_radio_io_ok(core) ||
            !nrf24_write_payload(radio, packet, sizeof(packet)) ||
            !core_radio_io_ok(core)) {
        nrf24_abort_send(radio);
        if (kind == TRANSPORT_TX_CONTROL) {
            core_control_failed(core, packet);
            (void)transport_ring_discard(&core->control_tx,
                TRANSPORT_CONTROL_RECORD_SIZE);
        } else if (kind == TRANSPORT_TX_REGISTRATION) {
            core_finish_registration_tx(core, false,
                TRANSPORT_REGISTRATION_FAILURE_RADIO);
        } else if (kind == TRANSPORT_TX_COMMAND) {
            core_finish_outbound_command(core, slot, false,
                TRANSPORT_COMMAND_FAILURE_RADIO);
        } else {
            core_finish_outbound_pipe(core, slot, false,
                TRANSPORT_PIPE_FAILURE_RADIO);
        }
        core_restore_rx(core);
        transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
            TRANSPORT_CORE_INVALID_ID, 0x545851u);
        core_exit(core, critical);
        return;
    }
    core->tx.active = true;
    core->tx.kind = kind;
    core->tx.slot = slot;
    core->tx.payload_length = (uint8_t)payload_length;
    core->tx.last_packet = last_packet;
    memset(&core->retry, 0, sizeof(core->retry));
    core->retry.max_restarts = core->config.max_rt_restarts;
    nrf24_set_ce(radio, true);
    core_exit(core, critical);
}

static bool core_queue_packet(transport_core_t *core,
        uint8_t message_type, uint8_t destination_id, uint8_t message_id,
        uint8_t wire_flags, const uint8_t *payload, size_t payload_length) {
    uint8_t packet[NRF24_MAX_PAYLOAD];
    transport_critical_state_t critical;
    bool queued = false;
    if (core == NULL || !transport_ring_is_attached(&core->control_tx) ||
            !core_build_packet(core, message_type, destination_id, message_id,
                wire_flags, payload, payload_length, packet)) {
        return false;
    }
    critical = core_enter(core);
    if (transport_ring_writable(&core->control_tx) >= sizeof(packet) &&
            transport_ring_write(&core->control_tx, packet, sizeof(packet)) ==
                sizeof(packet)) {
        core->stats.control_packets_queued++;
        queued = true;
    } else {
        core->sticky_errors |=
            (uint32_t)1u << TRANSPORT_ERROR_CONTROL_QUEUE_FULL;
    }
    core_exit(core, critical);
    return queued;
}

bool transport_core_queue_control(transport_core_t *core,
        uint8_t message_type, uint8_t destination_id, uint8_t message_id,
        const uint8_t *payload, size_t payload_length) {
    return core_queue_packet(core, message_type, destination_id, message_id,
        TRANSPORT_WIRE_LAST_PACKET, payload, payload_length);
}

