z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
static bool core_queue_cts(transport_core_t *core, uint8_t destination_id,
        uint8_t message_id, uint8_t original_type,
        transport_cts_result_t result, uint32_t value) {
    uint8_t payload[6];
    payload[0] = original_type;
    payload[1] = (uint8_t)result;
    core_write_le32(payload + 2, value);
    return transport_core_queue_control(core, TRANSPORT_WIRE_CTS,
        destination_id, message_id, payload, sizeof(payload));
}

static uint8_t queue_used(const transport_core_t *core) {
    return (uint8_t)(core->event_write - core->event_read);
}

static bool queue_descriptor(transport_core_t *core,
        const transport_event_descriptor_t *descriptor) {
    uint8_t write;
    bool queued = false;
    transport_critical_state_t critical = core_enter(core);
    if (queue_used(core) >= TRANSPORT_CORE_EVENT_QUEUE_SIZE) {
        core->stats.event_queue_overflows++;
        core->sticky_errors |= (uint32_t)1u << TRANSPORT_ERROR_EVENT_QUEUE_OVERFLOW;
    } else {
        write = core->event_write;
        core->events[write % TRANSPORT_CORE_EVENT_QUEUE_SIZE] = *descriptor;
        TRANSPORT_RING_MEMORY_BARRIER();
        core->event_write = (uint8_t)(write + 1u);
        core->stats.events_emitted++;
        queued = true;
    }
    core_exit(core, critical);
    return queued;
}

static bool core_is_registration_type(uint8_t message_type) {
    return message_type == TRANSPORT_WIRE_ENUM_HELLO ||
        message_type == TRANSPORT_WIRE_ENUM_ASSIGN ||
        message_type == TRANSPORT_WIRE_ENUM_CONFIRM;
}

static bool core_registration_shape_valid(uint8_t message_type,
        uint8_t source_id, uint8_t destination_id, size_t payload_length) {
    if (message_type == TRANSPORT_WIRE_ENUM_HELLO) {
        return source_id == TRANSPORT_CORE_INVALID_ID && destination_id == 0 &&
            payload_length == 8;
    }
    if (message_type == TRANSPORT_WIRE_ENUM_ASSIGN) {
        return source_id == 0 && destination_id == TRANSPORT_CORE_INVALID_ID &&
            payload_length == 9;
    }
    if (message_type == TRANSPORT_WIRE_ENUM_CONFIRM) {
        return source_id > 0 && source_id < 0xfe && destination_id == 0 &&
            payload_length == 9;
    }
    return false;
}

static void core_finish_registration_tx(transport_core_t *core, bool sent,
        uint32_t reason) {
    transport_event_descriptor_t descriptor;
    uint8_t *packet;
    if (core == NULL || !core->registration_tx.pending) return;
    packet = core->registration_tx.packet;
    memset(&descriptor, 0, sizeof(descriptor));
    descriptor.fields.type = sent ? TRANSPORT_EVENT_REGISTRATION_SENT :
        TRANSPORT_EVENT_REGISTRATION_FAILED;
    descriptor.fields.flags = TRANSPORT_EVENT_FLAG_TX;
    descriptor.fields.object_id = packet[0] & TRANSPORT_WIRE_TYPE_MASK;
    descriptor.fields.source_id = packet[2];
    descriptor.fields.transaction_id = packet[3];
    descriptor.fields.value0 = packet[2];
    descriptor.fields.value1 = sent ? 0 : reason;
    core->registration_tx.pending = false;
    if (sent) core->stats.registration_sent++;
    else core->stats.registration_failed++;
    (void)queue_descriptor(core, &descriptor);
}

static void core_receive_registration(transport_core_t *core,
        uint8_t message_type, uint8_t source_id, uint8_t destination_id,
        uint8_t message_id, const uint8_t *payload, size_t payload_length) {
    transport_event_descriptor_t descriptor;
    if (!core_registration_shape_valid(message_type, source_id,
            destination_id, payload_length)) {
        core->stats.protocol_errors++;
        return;
    }
    if ((message_type == TRANSPORT_WIRE_ENUM_HELLO ||
         message_type == TRANSPORT_WIRE_ENUM_CONFIRM) &&
            core->config.node_id != 0) {
        return;
    }
    if (message_type == TRANSPORT_WIRE_ENUM_ASSIGN &&
            core->config.node_id != TRANSPORT_CORE_INVALID_ID) {
        return;
    }
    memset(&descriptor, 0, sizeof(descriptor));
    descriptor.fields.type = TRANSPORT_EVENT_REGISTRATION_RECEIVED;
    descriptor.fields.object_id = message_type;
    descriptor.fields.source_id = source_id;
    descriptor.fields.transaction_id = message_id;
    descriptor.fields.data_length = (uint16_t)payload_length;
    descriptor.fields.value0 = destination_id;
    descriptor.payload_kind = TRANSPORT_EVENT_PAYLOAD_INLINE;
    memcpy(descriptor.inline_data, payload, payload_length);
    if (queue_descriptor(core, &descriptor)) core->stats.registration_rx++;
}

static void dequeue_descriptor(transport_core_t *core) {
    TRANSPORT_RING_MEMORY_BARRIER();
    core->event_read = (uint8_t)(core->event_read + 1u);
}

static bool queue_pipe_data_event(transport_core_t *core, uint8_t pipe_id) {
    transport_event_descriptor_t descriptor;
    transport_pipe_slot_t *pipe = &core->pipes[pipe_id];
    if (pipe->rx_event_pending) return true;
    memset(&descriptor, 0, sizeof(descriptor));
    descriptor.fields.type = TRANSPORT_EVENT_PIPE_RX_DATA;
    descriptor.fields.object_id = pipe_id;
    descriptor.fields.source_id = pipe->peer_id;
    descriptor.fields.transaction_id = pipe->session_id;
    descriptor.payload_kind = TRANSPORT_EVENT_PAYLOAD_PIPE_RX;
    descriptor.payload_index = pipe_id;
    if (!queue_descriptor(core, &descriptor)) return false;
    pipe->rx_event_pending = true;
    return true;
}

static bool queue_pipe_tx_space_event(transport_core_t *core,
        uint8_t pipe_id) {
    transport_event_fields_t event;
    transport_pipe_slot_t *pipe = &core->pipes[pipe_id];
    if (pipe->tx_space_event_pending) return true;
    memset(&event, 0, sizeof(event));
    event.type = TRANSPORT_EVENT_PIPE_TX_SPACE;
    event.flags = TRANSPORT_EVENT_FLAG_TX;
    event.object_id = pipe_id;
    event.source_id = pipe->peer_id;
    event.transaction_id = pipe->session_id;
    event.value0 = (uint32_t)transport_ring_writable(&pipe->buffer);
    event.value1 = pipe->granted_bytes - pipe->transferred_bytes;
    if (!transport_core_emit(core, &event)) return false;
    pipe->tx_space_event_pending = true;
    return true;
}

static void core_maybe_queue_rx_credit(transport_core_t *core,
        uint8_t pipe_id) {
    transport_pipe_slot_t *pipe = &core->pipes[pipe_id];
    uint32_t desired;
    if (pipe->direction != TRANSPORT_DIRECTION_RX ||
            pipe->state != TRANSPORT_PIPE_OPEN ||
            pipe->credit_update_pending) {
        return;
    }
    /* Do not turn the half-duplex receiver around while the peer can still
       be transmitting against its current credit.  Replenish only after the
       granted window is exhausted and the sender has necessarily stopped. */
    if (pipe->transferred_bytes != pipe->granted_bytes) return;
    desired = pipe->transferred_bytes +
        (uint32_t)transport_ring_writable(&pipe->buffer);
    if (desired == pipe->granted_bytes) return;
    if (core_queue_cts(core, pipe->peer_id, (uint8_t)pipe->session_id,
            TRANSPORT_WIRE_STREAM, TRANSPORT_CTS_ACCEPTED, desired)) {
        pipe->credit_update_pending = true;
    }
}

static bool core_is_command_type(uint8_t message_type) {
    return message_type == TRANSPORT_WIRE_COMMAND ||
        message_type == TRANSPORT_WIRE_COMMAND_REPLY ||
        message_type == TRANSPORT_WIRE_MANAGEMENT_REQUEST ||
        message_type == TRANSPORT_WIRE_MANAGEMENT_REPLY;
}

static int core_find_command_slot(transport_core_t *core, uint8_t message_type,
        uint8_t source_id, uint8_t message_id, bool allow_free) {
    int free_slot = -1;
    uint8_t i;
    for (i = 0; i < TRANSPORT_CORE_COMMAND_SLOTS; ++i) {
        transport_command_slot_t *command = &core->commands[i];
        if (command->state == TRANSPORT_COMMAND_FREE) {
            if (free_slot < 0) free_slot = i;
        } else if (command->direction == TRANSPORT_DIRECTION_RX &&
                (command->state == TRANSPORT_COMMAND_CTS_SENT ||
                 command->state == TRANSPORT_COMMAND_RECEIVING) &&
                command->message_type == message_type &&
                command->peer_id == source_id &&
                command->transaction_id == message_id) {
            return i;
        }
    }
    return allow_free ? free_slot : -1;
}

static void core_discard_command(transport_command_slot_t *command) {
    (void)transport_ring_discard(&command->buffer,
        transport_ring_readable(&command->buffer));
    command->direction = TRANSPORT_DIRECTION_NONE;
    command->state = TRANSPORT_COMMAND_FREE;
    command->target_length = 0;
    command->transferred_length = 0;
}

static int core_find_outbound_command(transport_core_t *core,
        uint8_t message_type, uint8_t peer_id, uint8_t message_id) {
    uint8_t slot;
    for (slot = 0; slot < TRANSPORT_CORE_COMMAND_SLOTS; ++slot) {
        transport_command_slot_t *command = &core->commands[slot];
        if (command->direction == TRANSPORT_DIRECTION_TX &&
                command->message_type == message_type &&
                command->peer_id == peer_id &&
                command->transaction_id == message_id) {
            return slot;
        }
    }
    return -1;
}

static void core_finish_outbound_command(transport_core_t *core, uint8_t slot,
        bool sent, uint32_t value) {
    transport_event_fields_t event;
    transport_command_slot_t *command;
    if (core == NULL || slot >= TRANSPORT_CORE_COMMAND_SLOTS) return;
    command = &core->commands[slot];
    if (command->direction != TRANSPORT_DIRECTION_TX) return;
    memset(&event, 0, sizeof(event));
    event.type = sent ? TRANSPORT_EVENT_COMMAND_SENT :
        TRANSPORT_EVENT_COMMAND_FAILED;
    event.object_id = slot;
    event.source_id = command->peer_id;
    event.transaction_id = command->transaction_id;
    event.value0 = command->message_type;
    event.value1 = value;
    core_discard_command(command);
    if (sent) core->stats.commands_sent++;
    else core->stats.commands_failed++;
    (void)transport_core_emit(core, &event);
}

static bool core_outbound_application_busy(const transport_core_t *core) {
    uint8_t slot;
    for (slot = 0; slot < TRANSPORT_CORE_COMMAND_SLOTS; ++slot) {
        if (core->commands[slot].direction == TRANSPORT_DIRECTION_TX) {
            return true;
        }
    }
    for (slot = 0; slot < TRANSPORT_CORE_PIPE_SLOTS; ++slot) {
        if (core->pipes[slot].direction == TRANSPORT_DIRECTION_TX) return true;
    }
    return false;
}

static int core_find_outbound_pipe(transport_core_t *core, uint8_t peer_id,
        uint8_t stream_id) {
    uint8_t slot;
    for (slot = 0; slot < TRANSPORT_CORE_PIPE_SLOTS; ++slot) {
        transport_pipe_slot_t *pipe = &core->pipes[slot];
        if (pipe->direction == TRANSPORT_DIRECTION_TX &&
                pipe->peer_id == peer_id && pipe->session_id == stream_id) {
            return slot;
        }
    }
    return -1;
}

static void core_reset_pipe(transport_pipe_slot_t *pipe) {
    transport_ring_reset(&pipe->buffer);
    pipe->direction = TRANSPORT_DIRECTION_NONE;
    pipe->state = TRANSPORT_PIPE_FREE;
    pipe->peer_id = TRANSPORT_CORE_INVALID_ID;
    pipe->session_id = 0;
    pipe->granted_bytes = 0;
    pipe->transferred_bytes = 0;
    pipe->lease_deadline_ms = 0;
    pipe->rx_event_pending = false;
    pipe->tx_space_event_pending = false;
    pipe->credit_update_pending = false;
}

