z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
static void core_finish_outbound_pipe(transport_core_t *core, uint8_t slot,
        bool closed, uint32_t reason) {
    transport_event_fields_t event;
    transport_pipe_slot_t *pipe;
    if (core == NULL || slot >= TRANSPORT_CORE_PIPE_SLOTS) return;
    pipe = &core->pipes[slot];
    if (pipe->direction != TRANSPORT_DIRECTION_TX) return;
    memset(&event, 0, sizeof(event));
    event.type = closed ? TRANSPORT_EVENT_PIPE_CLOSED :
        TRANSPORT_EVENT_PIPE_FAILED;
    event.flags = TRANSPORT_EVENT_FLAG_TX;
    event.object_id = slot;
    event.source_id = pipe->peer_id;
    event.transaction_id = pipe->session_id;
    event.value0 = closed ? pipe->transferred_bytes : reason;
    event.value1 = closed ? 0 : pipe->transferred_bytes;
    pipe->direction = TRANSPORT_DIRECTION_NONE;
    pipe->state = closed ? TRANSPORT_PIPE_CLOSED : TRANSPORT_PIPE_FAILED;
    pipe->tx_space_event_pending = false;
    if (closed) core->stats.pipes_closed++;
    else core->stats.pipes_failed++;
    if (!transport_core_emit(core, &event)) core_reset_pipe(pipe);
}

bool transport_core_send_command(transport_core_t *core,
        uint8_t destination_id, uint8_t message_type, uint8_t message_id,
        const uint8_t *data, size_t length) {
    transport_critical_state_t critical;
    transport_command_slot_t *command = NULL;
    uint8_t intent[2];
    uint8_t slot;
    if (core == NULL || !core->started ||
            destination_id == TRANSPORT_CORE_INVALID_ID ||
            destination_id == core->config.node_id ||
            !core_is_command_type(message_type) || length > UINT16_MAX ||
            (data == NULL && length != 0)) {
        return false;
    }
    critical = core_enter(core);
    if (core_outbound_application_busy(core)) {
        core_exit(core, critical);
        return false;
    }
    for (slot = 0; slot < TRANSPORT_CORE_COMMAND_SLOTS; ++slot) {
        if (core->commands[slot].state == TRANSPORT_COMMAND_FREE &&
                core->commands[slot].buffer.capacity >= length) {
            command = &core->commands[slot];
            command->direction = TRANSPORT_DIRECTION_TX;
            command->state = TRANSPORT_COMMAND_TX_LOADING;
            command->peer_id = destination_id;
            command->message_type = message_type;
            command->transaction_id = message_id;
            command->target_length = (uint16_t)length;
            command->transferred_length = 0;
            break;
        }
    }
    core_exit(core, critical);
    if (command == NULL) return false;
    if (length != 0 &&
            transport_ring_write(&command->buffer, data, length) != length) {
        core_discard_command(command);
        return false;
    }
    command->state = TRANSPORT_COMMAND_TX_INTENT_QUEUED;
    core_write_le16(intent, (uint16_t)length);
    if (!core_queue_packet(core, message_type, destination_id, message_id,
            TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET,
            intent, sizeof(intent))) {
        core_discard_command(command);
        return false;
    }
    core_tx_kick(core);
    return true;
}

bool transport_core_send_registration(transport_core_t *core,
        uint8_t message_type, uint8_t destination_id, uint8_t message_id,
        const uint8_t address[NRF24_ADDR_LEN], const uint8_t *data,
        size_t length) {
    uint8_t packet[NRF24_MAX_PAYLOAD];
    transport_critical_state_t critical;
    if (core == NULL || !core->started || address == NULL ||
            (data == NULL && length != 0) ||
            !core_is_registration_type(message_type) ||
            !core_registration_shape_valid(message_type,
                core->config.node_id, destination_id, length) ||
            !core_build_packet(core, message_type, destination_id, message_id,
                TRANSPORT_WIRE_LAST_PACKET, data, length, packet)) {
        return false;
    }
    critical = core_enter(core);
    if (core->registration_tx.pending) {
        core_exit(core, critical);
        return false;
    }
    memcpy(core->registration_tx.address, address, NRF24_ADDR_LEN);
    memcpy(core->registration_tx.packet, packet, sizeof(packet));
    core->registration_tx.pending = true;
    core_exit(core, critical);
    core_tx_kick(core);
    return true;
}

int transport_core_open_pipe(transport_core_t *core, uint8_t destination_id,
        uint8_t stream_id) {
    transport_critical_state_t critical;
    transport_pipe_slot_t *pipe = NULL;
    uint8_t slot;
    if (core == NULL || !core->started ||
            destination_id == TRANSPORT_CORE_INVALID_ID ||
            destination_id == core->config.node_id) {
        return -1;
    }
    critical = core_enter(core);
    if (core_outbound_application_busy(core)) {
        core_exit(core, critical);
        return -1;
    }
    for (slot = 0; slot < TRANSPORT_CORE_PIPE_SLOTS; ++slot) {
        if (core->pipes[slot].state == TRANSPORT_PIPE_FREE) {
            pipe = &core->pipes[slot];
            transport_ring_reset(&pipe->buffer);
            pipe->peer_id = destination_id;
            pipe->session_id = stream_id;
            pipe->granted_bytes = 0;
            pipe->transferred_bytes = 0;
            pipe->direction = TRANSPORT_DIRECTION_TX;
            pipe->state = TRANSPORT_PIPE_TX_INTENT_QUEUED;
            pipe->rx_event_pending = false;
            pipe->tx_space_event_pending = false;
            pipe->credit_update_pending = false;
            break;
        }
    }
    core_exit(core, critical);
    if (pipe == NULL) return -1;
    if (!core_queue_packet(core, TRANSPORT_WIRE_STREAM, destination_id,
            stream_id, TRANSPORT_WIRE_INTENT | TRANSPORT_WIRE_LAST_PACKET,
            NULL, 0)) {
        core_reset_pipe(pipe);
        return -1;
    }
    core_tx_kick(core);
    return slot;
}

bool transport_core_close_pipe(transport_core_t *core, uint8_t slot) {
    transport_critical_state_t critical;
    transport_pipe_slot_t *pipe;
    bool accepted = false;
    if (core == NULL || slot >= TRANSPORT_CORE_PIPE_SLOTS) return false;
    critical = core_enter(core);
    pipe = &core->pipes[slot];
    if (pipe->direction == TRANSPORT_DIRECTION_TX &&
            pipe->state == TRANSPORT_PIPE_TX_OPEN) {
        pipe->state = TRANSPORT_PIPE_TX_CLOSING;
        pipe->lease_deadline_ms = core_now_ms(core) + core->config.pipe_lease_ms;
        accepted = true;
    } else if (pipe->direction == TRANSPORT_DIRECTION_TX &&
            pipe->state == TRANSPORT_PIPE_TX_CLOSING) {
        accepted = true;
    }
    core_exit(core, critical);
    if (accepted) core_tx_kick(core);
    return accepted;
}

