z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
static void core_receive_command_intent(transport_core_t *core,
        uint8_t message_type, uint8_t source_id, uint8_t message_id,
        const uint8_t *payload, size_t payload_length) {
    int slot;
    uint16_t target_length;
    transport_command_slot_t *command;
    transport_cts_result_t result;
    if (payload_length != 2) {
        (void)core_queue_cts(core, source_id, message_id, message_type,
            TRANSPORT_CTS_INVALID, 0);
        return;
    }
    target_length = core_read_le16(payload);
    slot = core_find_command_slot(core, message_type, source_id, message_id,
        false);
    if (slot >= 0) {
        command = &core->commands[slot];
        result = command->target_length == target_length ?
            TRANSPORT_CTS_ACCEPTED : TRANSPORT_CTS_BUSY;
        (void)core_queue_cts(core, source_id, message_id, message_type, result,
            command->target_length);
        return;
    }
    slot = core_find_command_slot(core, message_type, source_id, message_id,
        true);
    if (slot < 0) {
        (void)core_queue_cts(core, source_id, message_id, message_type,
            TRANSPORT_CTS_NO_BUFFER, 0);
        return;
    }
    command = &core->commands[slot];
    if (target_length > command->buffer.capacity) {
        (void)core_queue_cts(core, source_id, message_id, message_type,
            TRANSPORT_CTS_TOO_LARGE, (uint32_t)command->buffer.capacity);
        return;
    }
    if (transport_ring_readable(&command->buffer) != 0) {
        (void)core_queue_cts(core, source_id, message_id, message_type,
            TRANSPORT_CTS_BUSY, 0);
        return;
    }
    command->peer_id = source_id;
    command->message_type = message_type;
    command->transaction_id = message_id;
    command->target_length = target_length;
    command->direction = TRANSPORT_DIRECTION_RX;
    command->state = TRANSPORT_COMMAND_INTENT_RECEIVED;
    command->lease_deadline_ms = core_now_ms(core) +
        core->config.command_lease_ms;
    if (!core_queue_cts(core, source_id, message_id, message_type,
            TRANSPORT_CTS_ACCEPTED, target_length)) {
        core_discard_command(command);
        transport_core_report_error(core, TRANSPORT_ERROR_CONTROL_QUEUE_FULL,
            (uint8_t)slot, message_id);
        return;
    }
    command->state = TRANSPORT_COMMAND_CTS_SENT;
}

static void core_receive_command_fragment(transport_core_t *core,
        uint8_t message_type, uint8_t source_id, uint8_t message_id,
        const uint8_t *payload, size_t payload_length, bool last_packet) {
    int slot = core_find_command_slot(core, message_type, source_id, message_id,
        false);
    transport_command_slot_t *command;
    size_t new_length;
    if (slot < 0) {
        transport_core_report_error(core, TRANSPORT_ERROR_PROTOCOL,
            TRANSPORT_CORE_INVALID_ID, message_id);
        return;
    }
    command = &core->commands[slot];
    new_length = transport_ring_readable(&command->buffer) + payload_length;
    if (new_length > command->target_length ||
            new_length > command->buffer.capacity) {
        transport_core_report_error(core, TRANSPORT_ERROR_COMMAND_TOO_LARGE,
            (uint8_t)slot, (uint32_t)new_length);
        (void)core_queue_cts(core, source_id, message_id, message_type,
            TRANSPORT_CTS_INVALID, (uint32_t)new_length);
        core_discard_command(command);
        return;
    }
    if (payload_length != 0 && transport_ring_write(&command->buffer, payload,
            payload_length) != payload_length) {
        transport_core_report_error(core, TRANSPORT_ERROR_RX_OVERRUN,
            (uint8_t)slot, (uint32_t)payload_length);
        core_discard_command(command);
        return;
    }
    command->state = TRANSPORT_COMMAND_RECEIVING;
    command->lease_deadline_ms = core_now_ms(core) +
        core->config.command_lease_ms;
    if (last_packet) {
        if (new_length != command->target_length) {
            transport_core_report_error(core, TRANSPORT_ERROR_PROTOCOL,
                (uint8_t)slot, (uint32_t)new_length);
            (void)core_queue_cts(core, source_id, message_id, message_type,
                TRANSPORT_CTS_INVALID, (uint32_t)new_length);
            core_discard_command(command);
            return;
        }
        (void)transport_core_commit_command(core, (uint8_t)slot, source_id,
            message_id, new_length);
    }
}

static int core_find_pipe_slot(transport_core_t *core, uint8_t source_id,
        uint8_t stream_id, bool allow_free) {
    int free_slot = -1;
    uint8_t i;
    for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
        transport_pipe_slot_t *pipe = &core->pipes[i];
        if (pipe->direction == TRANSPORT_DIRECTION_RX &&
                (pipe->state == TRANSPORT_PIPE_CTS_SENT ||
                 pipe->state == TRANSPORT_PIPE_OPEN) &&
                pipe->peer_id == source_id &&
                pipe->session_id == stream_id) {
            return i;
        }
        if (free_slot < 0 && pipe->state == TRANSPORT_PIPE_FREE) {
            free_slot = i;
        }
    }
    return allow_free ? free_slot : -1;
}

static void core_receive_pipe_intent(transport_core_t *core,
        uint8_t source_id, uint8_t stream_id, size_t payload_length) {
    int slot;
    transport_pipe_slot_t *pipe;
    if (payload_length != 0) {
        (void)core_queue_cts(core, source_id, stream_id, TRANSPORT_WIRE_STREAM,
            TRANSPORT_CTS_INVALID, 0);
        return;
    }
    slot = core_find_pipe_slot(core, source_id, stream_id, false);
    if (slot >= 0) {
        pipe = &core->pipes[slot];
        (void)core_queue_cts(core, source_id, stream_id, TRANSPORT_WIRE_STREAM,
            TRANSPORT_CTS_ACCEPTED, pipe->granted_bytes);
        return;
    }
    slot = core_find_pipe_slot(core, source_id, stream_id, true);
    if (slot < 0) {
        (void)core_queue_cts(core, source_id, stream_id, TRANSPORT_WIRE_STREAM,
            TRANSPORT_CTS_NO_BUFFER, 0);
        return;
    }
    pipe = &core->pipes[slot];
    if (transport_ring_readable(&pipe->buffer) != 0) {
        (void)core_queue_cts(core, source_id, stream_id, TRANSPORT_WIRE_STREAM,
            TRANSPORT_CTS_BUSY, 0);
        return;
    }
    pipe->peer_id = source_id;
    pipe->session_id = stream_id;
    pipe->direction = TRANSPORT_DIRECTION_RX;
    pipe->state = TRANSPORT_PIPE_OPEN_INTENT_RECEIVED;
    pipe->granted_bytes = (uint32_t)pipe->buffer.capacity;
    pipe->transferred_bytes = 0;
    pipe->rx_event_pending = false;
    pipe->tx_space_event_pending = false;
    pipe->credit_update_pending = false;
    pipe->lease_deadline_ms = core_now_ms(core) + core->config.pipe_lease_ms;
    if (!core_queue_cts(core, source_id, stream_id, TRANSPORT_WIRE_STREAM,
            TRANSPORT_CTS_ACCEPTED, pipe->granted_bytes)) {
        core_reset_pipe(pipe);
        transport_core_report_error(core, TRANSPORT_ERROR_CONTROL_QUEUE_FULL,
            (uint8_t)slot, stream_id);
        return;
    }
    pipe->state = TRANSPORT_PIPE_CTS_SENT;
}

