z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
static void core_control_acked(transport_core_t *core, const uint8_t *packet) {
    uint8_t packet_type, original_type, result, peer_id, message_id;
    int slot;
    packet_type = packet[0] & TRANSPORT_WIRE_TYPE_MASK;
    peer_id = packet[2];
    message_id = packet[3];
    if (core_is_command_type(packet_type) &&
            (packet[4] & TRANSPORT_WIRE_INTENT) != 0) {
        slot = core_find_outbound_command(core, packet_type, peer_id,
            message_id);
        if (slot >= 0 && core->commands[slot].state ==
                TRANSPORT_COMMAND_TX_INTENT_QUEUED) {
            core->commands[slot].state = TRANSPORT_COMMAND_TX_WAIT_CTS;
            core->commands[slot].lease_deadline_ms = core_now_ms(core) +
                core->config.command_lease_ms;
        }
        return;
    }
    if (packet_type == TRANSPORT_WIRE_STREAM &&
            (packet[4] & TRANSPORT_WIRE_INTENT) != 0) {
        slot = core_find_outbound_pipe(core, peer_id, message_id);
        if (slot >= 0 && core->pipes[slot].state ==
                TRANSPORT_PIPE_TX_INTENT_QUEUED) {
            core->pipes[slot].state = TRANSPORT_PIPE_TX_WAIT_CTS;
            core->pipes[slot].lease_deadline_ms = core_now_ms(core) +
                core->config.pipe_lease_ms;
        }
        return;
    }
    if (packet_type != TRANSPORT_WIRE_CTS ||
            (packet[4] & TRANSPORT_WIRE_LENGTH_MASK) < 2) {
        return;
    }
    original_type = packet[TRANSPORT_WIRE_HEADER_SIZE];
    result = packet[TRANSPORT_WIRE_HEADER_SIZE + 1];
    if (result != TRANSPORT_CTS_ACCEPTED) return;
    if (core_is_command_type(original_type)) {
        slot = core_find_command_slot(core, original_type, peer_id,
            message_id, false);
        if (slot >= 0 &&
                core->commands[slot].state == TRANSPORT_COMMAND_CTS_SENT) {
            core->commands[slot].state = TRANSPORT_COMMAND_RECEIVING;
        }
    } else if (original_type == TRANSPORT_WIRE_STREAM) {
        transport_event_fields_t event;
        slot = core_find_pipe_slot(core, peer_id, message_id, false);
        if (slot < 0) return;
        if (core->pipes[slot].state == TRANSPORT_PIPE_OPEN &&
                core->pipes[slot].credit_update_pending) {
            core->pipes[slot].granted_bytes =
                core_read_le32(packet + TRANSPORT_WIRE_HEADER_SIZE + 2);
            core->pipes[slot].credit_update_pending = false;
            return;
        }
        if (core->pipes[slot].state != TRANSPORT_PIPE_CTS_SENT) return;
        core->pipes[slot].state = TRANSPORT_PIPE_OPEN;
        core->stats.pipes_opened++;
        memset(&event, 0, sizeof(event));
        event.type = TRANSPORT_EVENT_PIPE_OPENED;
        event.object_id = (uint8_t)slot;
        event.source_id = peer_id;
        event.transaction_id = message_id;
        if (!transport_core_emit(core, &event)) {
            core_reset_pipe(&core->pipes[slot]);
        }
    }
}

static void core_control_failed(transport_core_t *core,
        const uint8_t *packet) {
    uint8_t packet_type, original_type, result, peer_id, message_id;
    int slot;
    packet_type = packet[0] & TRANSPORT_WIRE_TYPE_MASK;
    peer_id = packet[2];
    message_id = packet[3];
    if (core_is_command_type(packet_type) &&
            (packet[4] & TRANSPORT_WIRE_INTENT) != 0) {
        slot = core_find_outbound_command(core, packet_type, peer_id,
            message_id);
        if (slot >= 0) {
            core_finish_outbound_command(core, (uint8_t)slot, false,
                TRANSPORT_COMMAND_FAILURE_RADIO);
        }
        return;
    }
    if (packet_type == TRANSPORT_WIRE_STREAM &&
            (packet[4] & TRANSPORT_WIRE_INTENT) != 0) {
        slot = core_find_outbound_pipe(core, peer_id, message_id);
        if (slot >= 0) {
            core_finish_outbound_pipe(core, (uint8_t)slot, false,
                TRANSPORT_PIPE_FAILURE_RADIO);
        }
        return;
    }
    if (packet_type != TRANSPORT_WIRE_CTS ||
            (packet[4] & TRANSPORT_WIRE_LENGTH_MASK) < 2) {
        return;
    }
    original_type = packet[TRANSPORT_WIRE_HEADER_SIZE];
    result = packet[TRANSPORT_WIRE_HEADER_SIZE + 1];
    if (result != TRANSPORT_CTS_ACCEPTED) return;
    if (core_is_command_type(original_type)) {
        slot = core_find_command_slot(core, original_type, peer_id,
            message_id, false);
        if (slot >= 0) core_discard_command(&core->commands[slot]);
    } else if (original_type == TRANSPORT_WIRE_STREAM) {
        slot = core_find_pipe_slot(core, peer_id, message_id, false);
        if (slot >= 0) {
            if (core->pipes[slot].state == TRANSPORT_PIPE_OPEN) {
                core->pipes[slot].credit_update_pending = false;
            } else {
                core_reset_pipe(&core->pipes[slot]);
            }
        }
    }
}

static void core_receive_cts(transport_core_t *core, uint8_t source_id,
        uint8_t message_id, const uint8_t *payload, size_t payload_length,
        bool last_packet) {
    uint8_t original_type, result;
    uint32_t value;
    int slot;
    if (!last_packet || payload_length != 6) {
        core->stats.protocol_errors++;
        return;
    }
    original_type = payload[0];
    result = payload[1];
    value = core_read_le32(payload + 2);
    if (original_type == TRANSPORT_WIRE_STREAM) {
        uint32_t delta;
        transport_pipe_slot_t *pipe;
        transport_event_fields_t event;
        slot = core_find_outbound_pipe(core, source_id, message_id);
        if (slot < 0) return;
        pipe = &core->pipes[slot];
        if (pipe->state == TRANSPORT_PIPE_TX_WAIT_CTS) {
            if (result != TRANSPORT_CTS_ACCEPTED || value == 0) {
                if (result == TRANSPORT_CTS_ACCEPTED ||
                        result > TRANSPORT_CTS_INVALID) {
                    result = TRANSPORT_CTS_INVALID;
                }
                core_finish_outbound_pipe(core, (uint8_t)slot, false,
                    TRANSPORT_PIPE_FAILURE_CTS_BASE + result);
                return;
            }
            pipe->granted_bytes = value;
            pipe->transferred_bytes = 0;
            pipe->state = TRANSPORT_PIPE_TX_OPEN;
            core->application_tx_not_before_ms = core_now_ms(core) +
                TRANSPORT_CORE_CTS_TURNAROUND_MS;
            pipe->lease_deadline_ms = core->config.pipe_lease_ms != 0 ?
                core_now_ms(core) + core->config.pipe_lease_ms : 0;
            memset(&event, 0, sizeof(event));
            event.type = TRANSPORT_EVENT_PIPE_OPENED;
            event.flags = TRANSPORT_EVENT_FLAG_TX;
            event.object_id = (uint8_t)slot;
            event.source_id = source_id;
            event.transaction_id = message_id;
            event.value0 = (uint32_t)pipe->buffer.capacity;
            event.value1 = value;
            core->stats.pipes_opened++;
            if (!transport_core_emit(core, &event)) core_reset_pipe(pipe);
            return;
        }
        if (result != TRANSPORT_CTS_ACCEPTED ||
                (pipe->state != TRANSPORT_PIPE_TX_OPEN &&
                 pipe->state != TRANSPORT_PIPE_TX_CLOSING)) {
            return;
        }
        delta = value - pipe->granted_bytes;
        if (delta != 0 && delta < 0x80000000u &&
                delta <= pipe->buffer.capacity) {
            pipe->granted_bytes = value;
            core->application_tx_not_before_ms = core_now_ms(core) +
                TRANSPORT_CORE_CTS_TURNAROUND_MS;
            if (core->config.pipe_lease_ms != 0) {
                pipe->lease_deadline_ms = core_now_ms(core) +
                    core->config.pipe_lease_ms;
            }
        }
        return;
    }
    if (!core_is_command_type(original_type)) return;
    slot = core_find_outbound_command(core, original_type, source_id,
        message_id);
    if (slot < 0 || core->commands[slot].state !=
            TRANSPORT_COMMAND_TX_WAIT_CTS) {
        return;
    }
    if (result == TRANSPORT_CTS_ACCEPTED &&
            value == core->commands[slot].target_length) {
        core->commands[slot].state = TRANSPORT_COMMAND_TX_SENDING;
        core->application_tx_not_before_ms = core_now_ms(core) +
            TRANSPORT_CORE_CTS_TURNAROUND_MS;
        core->commands[slot].lease_deadline_ms = core_now_ms(core) +
            core->config.command_lease_ms;
        return;
    }
    if (result == TRANSPORT_CTS_ACCEPTED) result = TRANSPORT_CTS_INVALID;
    if (result > TRANSPORT_CTS_INVALID) result = TRANSPORT_CTS_INVALID;
    core_finish_outbound_command(core, (uint8_t)slot, false,
        TRANSPORT_COMMAND_FAILURE_CTS_BASE + result);
}

