z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
static void core_receive_pipe_fragment(transport_core_t *core,
        uint8_t source_id, uint8_t stream_id, const uint8_t *payload,
        size_t payload_length, bool last_packet) {
    int slot = core_find_pipe_slot(core, source_id, stream_id, false);
    transport_pipe_slot_t *pipe;
    transport_event_fields_t event;
    if (slot < 0) {
        transport_core_report_error(core, TRANSPORT_ERROR_PROTOCOL,
            TRANSPORT_CORE_INVALID_ID, stream_id);
        return;
    }
    pipe = &core->pipes[slot];
    pipe->state = TRANSPORT_PIPE_OPEN;
    pipe->lease_deadline_ms = core_now_ms(core) + core->config.pipe_lease_ms;
    if ((uint32_t)payload_length >
            pipe->granted_bytes - pipe->transferred_bytes) {
        pipe->state = TRANSPORT_PIPE_FAILED;
        transport_core_report_error(core, TRANSPORT_ERROR_RX_OVERRUN,
            (uint8_t)slot, (uint32_t)payload_length);
        return;
    }
    if (payload_length != 0 && transport_core_pipe_rx_write(core,
            (uint8_t)slot, payload, payload_length) != payload_length) {
        pipe->state = TRANSPORT_PIPE_FAILED;
        return;
    }
    if (last_packet) {
        pipe->state = TRANSPORT_PIPE_CLOSED;
        memset(&event, 0, sizeof(event));
        event.type = TRANSPORT_EVENT_PIPE_CLOSED;
        event.object_id = (uint8_t)slot;
        event.source_id = source_id;
        event.transaction_id = stream_id;
        event.value0 = pipe->transferred_bytes;
        core->stats.pipes_closed++;
        (void)transport_core_emit(core, &event);
    }
}

static void core_receive_packet(transport_core_t *core, const uint8_t *packet,
        size_t packet_length) {
    uint8_t wire_type, message_type, source_id, destination_id, message_id;
    uint8_t flags, payload_length;
    uint32_t crc;
    bool last_packet, intent;
    if (packet_length != NRF24_MAX_PAYLOAD) {
        return;
    }
    wire_type = packet[0];
    if ((wire_type & TRANSPORT_WIRE_PROTOCOL_MASK) !=
            TRANSPORT_WIRE_PROTOCOL_ID) {
        return;
    }
    message_type = wire_type & TRANSPORT_WIRE_TYPE_MASK;
    source_id = packet[1];
    destination_id = packet[2];
    message_id = packet[3];
    flags = packet[4];
    payload_length = flags & TRANSPORT_WIRE_LENGTH_MASK;
    last_packet = (flags & TRANSPORT_WIRE_LAST_PACKET) != 0;
    intent = (flags & TRANSPORT_WIRE_INTENT) != 0;
    if ((flags & TRANSPORT_WIRE_RESERVED_FLAG) != 0 ||
            payload_length > TRANSPORT_WIRE_MAX_DATA ||
            TRANSPORT_WIRE_HEADER_SIZE + payload_length >= packet_length) {
        core->stats.protocol_errors++;
        return;
    }
    crc = core_crc32_update(0, core->config.network_id,
        sizeof(core->config.network_id));
    crc = core_crc32_update(crc, packet, TRANSPORT_WIRE_HEADER_SIZE);
    crc = core_crc32_update(crc, packet + TRANSPORT_WIRE_HEADER_SIZE,
        payload_length);
    if (packet[TRANSPORT_WIRE_HEADER_SIZE + payload_length] !=
            (uint8_t)crc) {
        core->stats.protocol_errors++;
        return;
    }
    if (core_is_registration_type(message_type)) {
        if (!last_packet || intent) {
            core->stats.protocol_errors++;
            return;
        }
        core_receive_registration(core, message_type, source_id,
            destination_id, message_id,
            packet + TRANSPORT_WIRE_HEADER_SIZE, payload_length);
        return;
    }
    if (core->config.node_id == TRANSPORT_CORE_INVALID_ID ||
            destination_id != core->config.node_id ||
            source_id == TRANSPORT_WIRE_UNASSIGNED_ID) {
        return;
    }
    if (intent && !last_packet) {
        core->stats.protocol_errors++;
        return;
    }
    if (message_type == TRANSPORT_WIRE_CTS && !intent) {
        core_receive_cts(core, source_id, message_id,
            packet + TRANSPORT_WIRE_HEADER_SIZE, payload_length, last_packet);
    } else if (core_is_command_type(message_type) && intent) {
        core_receive_command_intent(core, message_type, source_id, message_id,
            packet + TRANSPORT_WIRE_HEADER_SIZE, payload_length);
    } else if (message_type == TRANSPORT_WIRE_STREAM && intent) {
        core_receive_pipe_intent(core, source_id, message_id, payload_length);
    } else if (core_is_command_type(message_type)) {
        core_receive_command_fragment(core, message_type, source_id,
            message_id, packet + TRANSPORT_WIRE_HEADER_SIZE, payload_length,
            last_packet);
    } else if (message_type == TRANSPORT_WIRE_STREAM) {
        core_receive_pipe_fragment(core, source_id, message_id,
            packet + TRANSPORT_WIRE_HEADER_SIZE, payload_length, last_packet);
    } else {
        core->stats.protocol_errors++;
    }
}

void transport_core_init(transport_core_t *core,
        const transport_core_config_t *config) {
    uint8_t i;
    if (core == NULL) return;
    memset(core, 0, sizeof(*core));
    if (config != NULL) core->config = *config;
    else core->config.node_id = TRANSPORT_CORE_INVALID_ID;
    if (core->config.preferred_pipe_event_bytes == 0)
        core->config.preferred_pipe_event_bytes = 512;
    if (core->config.node_id == 0 && !core->config.has_service_address) {
        core->config.service_address[0] = TRANSPORT_CORE_INVALID_ID;
        memcpy(core->config.service_address + 1, core->config.network_id,
            sizeof(core->config.network_id));
        core->config.has_service_address = true;
    }
    core->retry.max_restarts = core->config.max_rt_restarts;
    for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i)
        core->pipes[i].peer_id = TRANSPORT_CORE_INVALID_ID;
}

bool transport_core_attach_command_buffer(transport_core_t *core, uint8_t slot,
        uint8_t *buffer, size_t capacity) {
    transport_command_slot_t *command;
    if (core == NULL || slot >= TRANSPORT_CORE_COMMAND_SLOTS || buffer == NULL ||
            capacity == 0 || core->started) return false;
    command = &core->commands[slot];
    memset(command, 0, sizeof(*command));
    if (!transport_ring_attach(&command->buffer, buffer, capacity)) return false;
    command->state = TRANSPORT_COMMAND_FREE;
    return true;
}

bool transport_core_attach_pipe_buffer(transport_core_t *core, uint8_t pipe,
        uint8_t *buffer, size_t capacity) {
    return core != NULL && pipe < TRANSPORT_CORE_PIPE_SLOTS && !core->started &&
        transport_ring_attach(&core->pipes[pipe].buffer, buffer, capacity);
}

bool transport_core_attach_control_tx_buffer(transport_core_t *core,
        uint8_t *buffer, size_t capacity) {
    return core != NULL && !core->started &&
        capacity >= TRANSPORT_CORE_CONTROL_TX_SLOTS *
            TRANSPORT_CONTROL_RECORD_SIZE &&
        transport_ring_attach(&core->control_tx, buffer, capacity);
}

static bool core_configure_rx_addresses(transport_core_t *core,
        uint8_t node_id, bool resume_rx) {
    uint8_t i;
    uint8_t address[NRF24_ADDR_LEN];
    nrf24_t *radio = core->config.radio.radio;
    if (node_id == 0xfe || (node_id == TRANSPORT_CORE_INVALID_ID &&
            !core->config.has_service_address)) {
        return false;
    }
    if (node_id == 0 && (!core->config.has_service_address ||
            core->config.service_address[0] != TRANSPORT_CORE_INVALID_ID ||
            memcmp(core->config.service_address + 1, core->config.network_id,
                sizeof(core->config.network_id)) != 0)) {
        return false;
    }
    nrf24_stop_listening(radio);
    for (i = 0; i < 6; ++i) nrf24_close_rx_pipe(radio, i);
    if (node_id == TRANSPORT_CORE_INVALID_ID) {
        nrf24_open_rx_pipe(radio, 1, core->config.service_address);
    } else {
        address[0] = node_id;
        memcpy(address + 1, core->config.network_id,
            sizeof(core->config.network_id));
        nrf24_open_rx_pipe(radio, 1, address);
        if (node_id == 0) {
            nrf24_open_rx_pipe(radio, 2, core->config.service_address);
        }
    }
    if (resume_rx) nrf24_start_listening(radio);
    return core_radio_io_ok(core);
}

bool transport_core_start(transport_core_t *core) {
    uint8_t i;
    if (core == NULL || core->started || core->config.radio.radio == NULL) return false;
    for (i = 0; i < TRANSPORT_CORE_COMMAND_SLOTS; ++i) {
        if (!transport_ring_is_attached(&core->commands[i].buffer))
            return false;
    }
    for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
        if (!transport_ring_is_attached(&core->pipes[i].buffer))
            return false;
    }
    if (!transport_ring_is_attached(&core->control_tx)) return false;
    if (!core_configure_rx_addresses(core, core->config.node_id, false))
        return false;
    core->started = true;
    return true;
}

bool transport_core_set_node_id(transport_core_t *core, uint8_t node_id) {
    transport_critical_state_t critical;
    uint8_t i;
    bool configured;
    if (core == NULL || !core->started || node_id == 0xfe) return false;
    critical = core_enter(core);
    if (core->tx.active || core->registration_tx.pending ||
            transport_ring_readable(&core->control_tx) != 0 ||
            core_radio_irq_is_low(core)) {
        core_exit(core, critical);
        return false;
    }
    for (i = 0; i < TRANSPORT_CORE_COMMAND_SLOTS; ++i) {
        if (core->commands[i].state != TRANSPORT_COMMAND_FREE) {
            core_exit(core, critical);
            return false;
        }
    }
    for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
        if (core->pipes[i].state != TRANSPORT_PIPE_FREE) {
            core_exit(core, critical);
            return false;
        }
    }
    configured = core_configure_rx_addresses(core, node_id, true);
    if (configured) core->config.node_id = node_id;
    core_exit(core, critical);
    return configured;
}

void transport_core_stop(transport_core_t *core) {
    uint8_t i;
    transport_critical_state_t critical;
    if (core == NULL) return;
    critical = core_enter(core);
    core->started = false;
    core->event_read = 0;
    core->event_write = 0;
    memset(core->events, 0, sizeof(core->events));
    memset(&core->retry, 0, sizeof(core->retry));
    memset(&core->tx, 0, sizeof(core->tx));
    memset(&core->registration_tx, 0, sizeof(core->registration_tx));
    core->retry.max_restarts = core->config.max_rt_restarts;
    for (i = 0; i < TRANSPORT_CORE_COMMAND_SLOTS; ++i) {
        transport_ring_reset(&core->commands[i].buffer);
        core->commands[i].direction = TRANSPORT_DIRECTION_NONE;
        core->commands[i].state = TRANSPORT_COMMAND_FREE;
    }
    for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
        core_reset_pipe(&core->pipes[i]);
    }
    transport_ring_reset(&core->control_tx);
    core_exit(core, critical);
}

