z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
void transport_core_on_radio_irq(transport_core_t *core) {
    nrf24_t *radio;
    uint8_t iteration;
    if (core == NULL || !core->started || core->config.radio.radio == NULL) {
        return;
    }
    radio = core->config.radio.radio;
    core->stats.radio_irqs++;

    for (iteration = 0; iteration < TRANSPORT_CORE_IRQ_SERVICE_LIMIT;
            ++iteration) {
        uint8_t status;
        bool handled = false;
        if (!core_radio_io_ok(core)) {
            transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
                TRANSPORT_CORE_INVALID_ID, 1u);
            return;
        }
        status = nrf24_read_status(radio);
        if (!core_radio_io_ok(core)) {
            transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
                TRANSPORT_CORE_INVALID_ID, 2u);
            return;
        }

        if ((status & NRF24_STATUS_RX_DR) != 0) {
            uint8_t received = 0;
            while (received < TRANSPORT_IRQ_MAX_RX_PAYLOADS &&
                    !nrf24_rx_fifo_empty(radio)) {
                uint8_t packet[NRF24_MAX_PAYLOAD];
                size_t packet_length = 0;
                if (!core_radio_io_ok(core) || !nrf24_read_payload(radio,
                        packet, sizeof(packet), &packet_length) ||
                        !core_radio_io_ok(core)) {
                    transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
                        TRANSPORT_CORE_INVALID_ID, 3u);
                    return;
                }
                core->stats.rx_packets++;
                core_receive_packet(core, packet, packet_length);
                received++;
            }
            if (nrf24_rx_fifo_empty(radio)) {
                nrf24_clear_irq(radio, NRF24_STATUS_RX_DR);
            }
            handled = true;
        }

        if ((status & NRF24_STATUS_TX_DS) != 0) {
            nrf24_set_ce(radio, false);
            nrf24_clear_irq(radio, NRF24_STATUS_TX_DS);
            core->stats.tx_packets++;
            if (core->tx.active) {
                if (core->tx.kind == TRANSPORT_TX_CONTROL) {
                    uint8_t packet[NRF24_MAX_PAYLOAD];
                    if (transport_ring_peek(&core->control_tx, packet,
                            sizeof(packet)) == sizeof(packet)) {
                        core_control_acked(core, packet);
                    }
                    (void)transport_ring_discard(&core->control_tx,
                        TRANSPORT_CONTROL_RECORD_SIZE);
                    core->stats.control_packets_acked++;
                } else if (core->tx.kind == TRANSPORT_TX_REGISTRATION) {
                    core_finish_registration_tx(core, true, 0);
                } else if (core->tx.kind == TRANSPORT_TX_COMMAND &&
                        core->tx.slot < TRANSPORT_CORE_COMMAND_SLOTS) {
                    uint8_t slot = core->tx.slot;
                    transport_command_slot_t *command = &core->commands[slot];
                    uint16_t total_length = command->target_length;
                    (void)transport_ring_discard(&command->buffer,
                        core->tx.payload_length);
                    command->transferred_length += core->tx.payload_length;
                    if (core->tx.last_packet) {
                        core_finish_outbound_command(core, slot, true,
                            total_length);
                    } else {
                        command->lease_deadline_ms = core_now_ms(core) +
                            core->config.command_lease_ms;
                    }
                } else if (core->tx.kind == TRANSPORT_TX_PIPE &&
                        core->tx.slot < TRANSPORT_CORE_PIPE_SLOTS) {
                    uint8_t slot = core->tx.slot;
                    transport_pipe_slot_t *pipe = &core->pipes[slot];
                    (void)transport_ring_discard(&pipe->buffer,
                        core->tx.payload_length);
                    pipe->transferred_bytes += core->tx.payload_length;
                    core->stats.pipe_tx_bytes += core->tx.payload_length;
                    if (core->tx.last_packet) {
                        core_finish_outbound_pipe(core, slot, true, 0);
                    } else {
                        if (core->config.pipe_lease_ms != 0) {
                            pipe->lease_deadline_ms = core_now_ms(core) +
                                core->config.pipe_lease_ms;
                        } else {
                            pipe->lease_deadline_ms = 0;
                        }
                        (void)queue_pipe_tx_space_event(core, slot);
                    }
                }
                core->tx.active = false;
                core->tx.kind = TRANSPORT_TX_NONE;
            }
            memset(&core->retry, 0, sizeof(core->retry));
            core->retry.max_restarts = core->config.max_rt_restarts;
            core_tx_kick(core);
            if (!core->tx.active) {
                core_restore_rx(core);
            }
            handled = true;
        }

        if ((status & NRF24_STATUS_MAX_RT) != 0) {
            uint32_t now = core_now_ms(core);
            core->stats.max_rt_events++;
            if (core->retry.state == TRANSPORT_RETRY_IDLE) {
                core->retry.state = TRANSPORT_RETRY_MAX_RT;
                core->retry.deadline_ms = now + core->config.max_rt_window_ms;
            }
            if ((core->retry.max_restarts ==
                    TRANSPORT_CORE_RESTARTS_UNBOUNDED ||
                 core->retry.restarts < core->retry.max_restarts) &&
                    !core_deadline_reached(now, core->retry.deadline_ms)) {
                core->retry.restarts++;
                core->stats.max_rt_restarts++;
                core->retry.state = TRANSPORT_RETRY_HW_ACTIVE;
                nrf24_set_ce(radio, false);
                nrf24_clear_irq(radio, NRF24_STATUS_MAX_RT);
                nrf24_set_ce(radio, true);
            } else {
                core->retry.state = TRANSPORT_RETRY_EXHAUSTED;
                nrf24_abort_send(radio);
                if (core->tx.active) {
                    if (core->tx.kind == TRANSPORT_TX_CONTROL) {
                        uint8_t packet[NRF24_MAX_PAYLOAD];
                        if (transport_ring_peek(&core->control_tx, packet,
                                sizeof(packet)) == sizeof(packet)) {
                            core_control_failed(core, packet);
                        }
                        (void)transport_ring_discard(&core->control_tx,
                            TRANSPORT_CONTROL_RECORD_SIZE);
                    } else if (core->tx.kind ==
                            TRANSPORT_TX_REGISTRATION) {
                        core_finish_registration_tx(core, false,
                            TRANSPORT_REGISTRATION_FAILURE_RADIO);
                    } else if (core->tx.kind == TRANSPORT_TX_COMMAND &&
                            core->tx.slot < TRANSPORT_CORE_COMMAND_SLOTS) {
                        core_finish_outbound_command(core, core->tx.slot,
                            false, TRANSPORT_COMMAND_FAILURE_RADIO);
                    } else if (core->tx.kind == TRANSPORT_TX_PIPE &&
                            core->tx.slot < TRANSPORT_CORE_PIPE_SLOTS) {
                        core_finish_outbound_pipe(core, core->tx.slot, false,
                            TRANSPORT_PIPE_FAILURE_RADIO);
                    }
                    core->tx.active = false;
                    core->tx.kind = TRANSPORT_TX_NONE;
                }
                transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
                    TRANSPORT_CORE_INVALID_ID, NRF24_STATUS_MAX_RT);
                core_tx_kick(core);
                if (!core->tx.active) core_restore_rx(core);
            }
            handled = true;
        }

