z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
        if (!core_radio_io_ok(core)) {
            transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
                TRANSPORT_CORE_INVALID_ID, 4u);
            return;
        }
        if (!core_radio_irq_is_low(core)) {
            transport_core_service(core);
            return;
        }
        if (!handled) {
            transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
                TRANSPORT_CORE_INVALID_ID, status);
            return;
        }
    }
    transport_core_report_error(core, TRANSPORT_ERROR_RADIO,
        TRANSPORT_CORE_INVALID_ID, 0x495251u);
    transport_core_service(core);
}

void transport_core_service(transport_core_t *core) {
    uint32_t now;
    uint8_t i;
    if (core == NULL || !core->started) return;
    now = core_now_ms(core);
    for (i = 0; i < TRANSPORT_CORE_COMMAND_SLOTS; ++i) {
        transport_command_slot_t *command = &core->commands[i];
        if (core->config.command_lease_ms != 0 &&
                command->direction == TRANSPORT_DIRECTION_RX &&
                (command->state == TRANSPORT_COMMAND_CTS_SENT ||
                 command->state == TRANSPORT_COMMAND_RECEIVING) &&
                core_deadline_reached(now, command->lease_deadline_ms)) {
            core_discard_command(command);
            transport_core_report_error(core, TRANSPORT_ERROR_COMMAND_TIMEOUT,
                i, command->transaction_id);
        } else if (core->config.command_lease_ms != 0 &&
                command->direction == TRANSPORT_DIRECTION_TX &&
                (command->state == TRANSPORT_COMMAND_TX_WAIT_CTS ||
                 command->state == TRANSPORT_COMMAND_TX_SENDING) &&
                core_deadline_reached(now, command->lease_deadline_ms)) {
            if (core->tx.active && core->tx.kind == TRANSPORT_TX_COMMAND &&
                    core->tx.slot == i) {
                transport_critical_state_t critical = core_enter(core);
                nrf24_abort_send(core->config.radio.radio);
                core->tx.active = false;
                core->tx.kind = TRANSPORT_TX_NONE;
                core_exit(core, critical);
            }
            core_finish_outbound_command(core, i, false,
                TRANSPORT_COMMAND_FAILURE_TIMEOUT);
            core_restore_rx(core);
        }
    }
    for (i = 0; i < TRANSPORT_CORE_PIPE_SLOTS; ++i) {
        transport_pipe_slot_t *pipe = &core->pipes[i];
        if (core->config.pipe_lease_ms != 0 &&
                pipe->direction == TRANSPORT_DIRECTION_RX &&
                (pipe->state == TRANSPORT_PIPE_CTS_SENT ||
                 pipe->state == TRANSPORT_PIPE_OPEN) &&
                core_deadline_reached(now, pipe->lease_deadline_ms)) {
            transport_event_fields_t event;
            transport_ring_reset(&pipe->buffer);
            pipe->rx_event_pending = false;
            pipe->state = TRANSPORT_PIPE_FAILED;
            memset(&event, 0, sizeof(event));
            event.type = TRANSPORT_EVENT_PIPE_FAILED;
            event.object_id = i;
            event.source_id = pipe->peer_id;
            event.transaction_id = pipe->session_id;
            event.value0 = TRANSPORT_ERROR_PIPE_TIMEOUT;
            if (!transport_core_emit(core, &event)) {
                transport_core_report_error(core,
                    TRANSPORT_ERROR_EVENT_QUEUE_OVERFLOW, i,
                    TRANSPORT_ERROR_PIPE_TIMEOUT);
            }
        } else if (core->config.pipe_lease_ms != 0 &&
                pipe->direction == TRANSPORT_DIRECTION_TX &&
                (pipe->state == TRANSPORT_PIPE_TX_WAIT_CTS ||
                 pipe->state == TRANSPORT_PIPE_TX_CLOSING ||
                 pipe->state == TRANSPORT_PIPE_TX_OPEN) &&
                core_deadline_reached(now, pipe->lease_deadline_ms)) {
            if (core->tx.active && core->tx.kind == TRANSPORT_TX_PIPE &&
                    core->tx.slot == i) {
                transport_critical_state_t critical = core_enter(core);
                nrf24_abort_send(core->config.radio.radio);
                core->tx.active = false;
                core->tx.kind = TRANSPORT_TX_NONE;
                core_exit(core, critical);
            }
            core_finish_outbound_pipe(core, i, false,
                TRANSPORT_PIPE_FAILURE_TIMEOUT);
            core_restore_rx(core);
        } else {
            core_maybe_queue_rx_credit(core, i);
        }
    }
    core_tx_kick(core);
}

bool transport_core_commit_command(transport_core_t *core, uint8_t slot,
        uint8_t source_id, uint16_t transaction_id, size_t length) {
    transport_event_descriptor_t descriptor;
    transport_command_slot_t *command;
    transport_critical_state_t critical;
    bool queued;
    if (core == NULL || slot >= TRANSPORT_CORE_COMMAND_SLOTS) return false;
    critical = core_enter(core);
    command = &core->commands[slot];
    if (!transport_ring_is_attached(&command->buffer) ||
            length > command->buffer.capacity || length > UINT16_MAX ||
            transport_ring_readable(&command->buffer) != length ||
            command->state == TRANSPORT_COMMAND_COMPLETE) {
        if (transport_ring_is_attached(&command->buffer) &&
                length > command->buffer.capacity)
            transport_core_report_error(core, TRANSPORT_ERROR_COMMAND_TOO_LARGE,
                slot, (uint32_t)length);
        core_exit(core, critical);
        return false;
    }
    command->peer_id = source_id;
    command->transaction_id = transaction_id;
    command->state = TRANSPORT_COMMAND_COMPLETE;
    memset(&descriptor, 0, sizeof(descriptor));
    descriptor.fields.type = TRANSPORT_EVENT_COMMAND_READY;
    descriptor.fields.object_id = slot;
    descriptor.fields.source_id = source_id;
    descriptor.fields.transaction_id = transaction_id;
    descriptor.fields.value0 = command->message_type;
    descriptor.payload_kind = TRANSPORT_EVENT_PAYLOAD_COMMAND_SLOT;
    descriptor.payload_index = slot;
    queued = queue_descriptor(core, &descriptor);
    if (!queued) core_discard_command(command);
    core_exit(core, critical);
    return queued;
}

size_t transport_core_pipe_rx_write(transport_core_t *core, uint8_t pipe_id,
        const uint8_t *data, size_t length) {
    size_t written;
    transport_critical_state_t critical;
    if (core == NULL || pipe_id >= TRANSPORT_CORE_PIPE_SLOTS || data == NULL) return 0;
    critical = core_enter(core);
    /* A radio fragment is committed atomically: never place a truncated
       fragment in the stream ring. */
    if (transport_ring_writable(&core->pipes[pipe_id].buffer) < length ||
            (!core->pipes[pipe_id].rx_event_pending &&
             queue_used(core) >= TRANSPORT_CORE_EVENT_QUEUE_SIZE)) {
        core->stats.rx_overruns++;
        transport_core_report_error(core, TRANSPORT_ERROR_RX_OVERRUN, pipe_id,
            (uint32_t)length);
        core_exit(core, critical);
        return 0;
    }
    written = transport_ring_write(&core->pipes[pipe_id].buffer, data, length);
    core->pipes[pipe_id].transferred_bytes += (uint32_t)written;
    core->stats.pipe_rx_bytes += (uint32_t)written;
    if (written != length) {
        core->stats.rx_overruns++;
        transport_core_report_error(core, TRANSPORT_ERROR_RX_OVERRUN, pipe_id,
            (uint32_t)(length - written));
    }
    if (written != 0 && !queue_pipe_data_event(core, pipe_id))
        core->pipes[pipe_id].state = TRANSPORT_PIPE_FAILED;
    core_exit(core, critical);
    return written;
}

size_t transport_core_pipe_tx_write(transport_core_t *core, uint8_t pipe_id,
        const uint8_t *data, size_t length) {
    transport_pipe_slot_t *pipe;
    transport_critical_state_t critical;
    size_t written;
    if (core == NULL || pipe_id >= TRANSPORT_CORE_PIPE_SLOTS ||
            (data == NULL && length != 0)) {
        return 0;
    }
    critical = core_enter(core);
    pipe = &core->pipes[pipe_id];
    if (pipe->direction != TRANSPORT_DIRECTION_TX ||
            (pipe->state != TRANSPORT_PIPE_TX_INTENT_QUEUED &&
             pipe->state != TRANSPORT_PIPE_TX_WAIT_CTS &&
             pipe->state != TRANSPORT_PIPE_TX_OPEN)) {
        core_exit(core, critical);
        return 0;
    }
    written = transport_ring_write(&pipe->buffer, data, length);
    if (written != 0 && core->config.pipe_lease_ms != 0) {
        pipe->lease_deadline_ms = core_now_ms(core) +
            core->config.pipe_lease_ms;
    }
    core_exit(core, critical);
    if (written != 0) core_tx_kick(core);
    return written;
}

size_t transport_core_pipe_tx_read(transport_core_t *core, uint8_t pipe_id,
        uint8_t *data, size_t length) {
    size_t count;
    if (core == NULL || pipe_id >= TRANSPORT_CORE_PIPE_SLOTS) return 0;
    count = transport_ring_read(&core->pipes[pipe_id].buffer, data, length);
    if (count == 0 && length != 0) core->stats.tx_underruns++;
    return count;
}

bool transport_core_emit(transport_core_t *core,
        const transport_event_fields_t *fields) {
    transport_event_descriptor_t descriptor;
    if (core == NULL || fields == NULL || fields->data_length != 0) return false;
    memset(&descriptor, 0, sizeof(descriptor));
    descriptor.fields = *fields;
    return queue_descriptor(core, &descriptor);
}

