z80/micropython/ports/stm32/boards/F405_OVERRIDE/drivers/nrf24/transport_core.c
void transport_core_report_error(transport_core_t *core, transport_error_t error,
        uint8_t object_id, uint32_t detail) {
    transport_event_fields_t fields;
    transport_critical_state_t critical;
    if (core == NULL || error == TRANSPORT_ERROR_NONE) return;
    critical = core_enter(core);
    if ((unsigned)error < 32u)
        core->sticky_errors |= (uint32_t)1u << (unsigned)error;
    if (error == TRANSPORT_ERROR_PROTOCOL) core->stats.protocol_errors++;
    memset(&fields, 0, sizeof(fields));
    fields.type = TRANSPORT_EVENT_CORE_ERROR;
    fields.flags = TRANSPORT_EVENT_FLAG_STICKY;
    fields.object_id = object_id;
    fields.value0 = (uint32_t)error;
    fields.value1 = detail;
    (void)transport_core_emit(core, &fields);
    core_exit(core, critical);
}

transport_poll_result_t transport_core_poll_into(transport_core_t *core,
        uint8_t *buffer, size_t capacity, size_t *event_length,
        size_t *required_capacity) {
    transport_event_descriptor_t *descriptor;
    transport_event_fields_t fields;
    size_t payload_capacity, payload_length = 0, record_length;
    uint8_t payload_kind, payload_index;
    bool keep_pipe_event;
    transport_poll_result_t result = TRANSPORT_POLL_EMPTY;
    if (event_length != NULL) *event_length = 0;
    if (required_capacity != NULL) *required_capacity = TRANSPORT_EVENT_HEADER_SIZE;
    if (core == NULL || buffer == NULL || event_length == NULL)
        return TRANSPORT_POLL_INVALID_ARGUMENT;
    if (capacity < TRANSPORT_EVENT_HEADER_SIZE) return TRANSPORT_POLL_BUFFER_TOO_SMALL;

    transport_core_service(core);

    for (;;) {
        keep_pipe_event = false;
        payload_length = 0;
        if (core->event_read == core->event_write) break;
        descriptor = &core->events[core->event_read % TRANSPORT_CORE_EVENT_QUEUE_SIZE];
        fields = descriptor->fields;
        payload_kind = descriptor->payload_kind;
        payload_index = descriptor->payload_index;
        payload_capacity = capacity - TRANSPORT_EVENT_HEADER_SIZE;

    if (payload_kind == TRANSPORT_EVENT_PAYLOAD_COMMAND_SLOT) {
        transport_command_slot_t *command;
        if (payload_index >= TRANSPORT_CORE_COMMAND_SLOTS)
            { result = TRANSPORT_POLL_INVALID_ARGUMENT; break; }
        command = &core->commands[payload_index];
        payload_length = transport_ring_readable(&command->buffer);
        if (required_capacity != NULL)
            *required_capacity = TRANSPORT_EVENT_HEADER_SIZE + payload_length;
        if (payload_length > payload_capacity || payload_length > UINT16_MAX)
            { result = TRANSPORT_POLL_BUFFER_TOO_SMALL; break; }
        (void)transport_ring_read(&command->buffer,
            transport_event_get_data(buffer), payload_length);
        command->direction = TRANSPORT_DIRECTION_NONE;
        command->target_length = 0;
        command->state = TRANSPORT_COMMAND_FREE;
    } else if (payload_kind == TRANSPORT_EVENT_PAYLOAD_PIPE_RX) {
        transport_pipe_slot_t *pipe;
        size_t preferred;
        if (payload_index >= TRANSPORT_CORE_PIPE_SLOTS)
            { result = TRANSPORT_POLL_INVALID_ARGUMENT; break; }
        pipe = &core->pipes[payload_index];
        preferred = core->config.preferred_pipe_event_bytes;
        payload_length = transport_ring_readable(&pipe->buffer);
        if (payload_length > preferred) payload_length = preferred;
        if (required_capacity != NULL)
            *required_capacity = TRANSPORT_EVENT_HEADER_SIZE + payload_length;
        if (payload_length != 0 && payload_capacity == 0)
            { result = TRANSPORT_POLL_BUFFER_TOO_SMALL; break; }
        if (payload_length > payload_capacity) payload_length = payload_capacity;
        if (payload_length == 0) {
            pipe->rx_event_pending = false;
            dequeue_descriptor(core);
            continue;
        }
        (void)transport_ring_read(&pipe->buffer,
            transport_event_get_data(buffer), payload_length);
        keep_pipe_event = transport_ring_readable(&pipe->buffer) != 0;
        if (keep_pipe_event) fields.flags |= TRANSPORT_EVENT_FLAG_MORE_DATA;
        else pipe->rx_event_pending = false;
        core_maybe_queue_rx_credit(core, payload_index);
    } else if (payload_kind == TRANSPORT_EVENT_PAYLOAD_INLINE) {
        payload_length = fields.data_length;
        if (payload_length > sizeof(descriptor->inline_data)) {
            result = TRANSPORT_POLL_INVALID_ARGUMENT;
            break;
        }
        if (required_capacity != NULL) {
            *required_capacity = TRANSPORT_EVENT_HEADER_SIZE + payload_length;
        }
        if (payload_length > payload_capacity) {
            result = TRANSPORT_POLL_BUFFER_TOO_SMALL;
            break;
        }
        memcpy(transport_event_get_data(buffer), descriptor->inline_data,
            payload_length);
    }

    fields.data_length = (uint16_t)payload_length;
    record_length = transport_event_record_size(fields.data_length);
    if (!transport_event_write_header(buffer, capacity, &fields))
        { result = TRANSPORT_POLL_BUFFER_TOO_SMALL; break; }
    if (!keep_pipe_event) dequeue_descriptor(core);
    if (fields.type == TRANSPORT_EVENT_PIPE_TX_SPACE &&
            fields.object_id < TRANSPORT_CORE_PIPE_SLOTS) {
        core->pipes[fields.object_id].tx_space_event_pending = false;
    }
    if ((fields.type == TRANSPORT_EVENT_PIPE_FAILED ||
         fields.type == TRANSPORT_EVENT_PIPE_CLOSED) &&
            fields.object_id < TRANSPORT_CORE_PIPE_SLOTS) {
        core_reset_pipe(&core->pipes[fields.object_id]);
    }
    core_tx_kick(core);
    core->stats.events_polled++;
    *event_length = record_length;
    result = TRANSPORT_POLL_EVENT;
    break;
    }
    return result;
}

const transport_core_stats_t *transport_core_get_stats(const transport_core_t *core) {
    return core == NULL ? NULL : &core->stats;
}

uint32_t transport_core_get_sticky_errors(const transport_core_t *core) {
    uint32_t errors;
    transport_critical_state_t critical;
    if (core == NULL) return 0;
    critical = core_enter((transport_core_t *)core);
    errors = core->sticky_errors;
    core_exit((transport_core_t *)core, critical);
    return errors;
}

void transport_core_clear_sticky_errors(transport_core_t *core, uint32_t mask) {
    transport_critical_state_t critical;
    if (core == NULL) return;
    critical = core_enter(core);
    core->sticky_errors &= ~mask;
    core_exit(core, critical);
}
